[
  {
    "name": "Ad Hominem",
    "altNames": ["Personal Attack", "Argumentum ad Hominem"],
    "description": "Attacking the person making the argument rather than addressing the argument itself.",
    "logicalForm": "Person A makes claim X. Person B attacks person A. Therefore, X is false.",
    "example": "You can't trust John's opinion on climate change because he's not a scientist.",
    "category": "Relevance"
  },
  {
    "name": "Anecdotal Evidence",
    "altNames": ["Anecdotal Fallacy"],
    "description": "Using personal experiences or isolated examples instead of sound arguments or compelling evidence.",
    "logicalForm": "Personal experience A supports conclusion X. Therefore, X is true.",
    "example": "My grandfather smoked every day and lived until 97, so smoking can't be that bad for you.",
    "category": "Weak Induction"
  },
  {
    "name": "Appeal to Authority",
    "altNames": ["Argumentum ad Verecundiam", "Appeal to False Authority"],
    "description": "Using the opinion of an authority figure or institution as evidence when the authority is not relevant to the argument.",
    "logicalForm": "Authority A believes X. Therefore, X is true.",
    "example": "Einstein believed in God, so God must exist.",
    "category": "Relevance"
  },
  {
    "name": "Appeal to Consequences",
    "altNames": ["Argumentum ad Consequentiam"],
    "description": "Arguing that a belief is true or false based on the consequences of accepting it.",
    "logicalForm": "If X is true, then Y will happen. Y is undesirable. Therefore, X is false.",
    "example": "If we allow same-sex marriage, traditional families will collapse. Therefore, same-sex marriage is wrong.",
    "category": "Presumption"
  },
  {
    "name": "Appeal to Emotion",
    "altNames": ["Argumentum ad Passiones", "Appeal to Fear", "Appeal to Pity"],
    "description": "Manipulating emotions rather than using valid reasoning to support an argument.",
    "logicalForm": "Emotional appeal is made. Therefore, conclusion X is true.",
    "example": "If you don't support this policy, children will suffer.",
    "category": "Relevance"
  },
  {
    "name": "Appeal to Ignorance",
    "altNames": ["Argument from Ignorance", "Ad Ignorantiam"],
    "description": "Claiming something is true because it has not been proven false, or vice versa.",
    "logicalForm": "It has not been proven that X is false. Therefore, X is true.",
    "example": "No one has proven that aliens don’t exist, so they must be real.",
    "category": "Presumption"
  },
  {
    "name": "Appeal to Novelty",
    "altNames": ["Argumentum ad Novitatem"],
    "description": "Arguing that something is better simply because it is new or modern.",
    "logicalForm": "X is new. Therefore, X is better than Y (which is old).",
    "example": "This new smartphone has the latest features, so it must be the best on the market.",
    "category": "Relevance"
  },
  {
    "name": "Appeal to Tradition",
    "altNames": ["Argumentum ad Antiquitatem"],
    "description": "Arguing that something is correct or better simply because it is older or traditional.",
    "logicalForm": "X is a tradition. Therefore, X is correct/right/better.",
    "example": "We’ve always done it this way, so it must be the best way.",
    "category": "Presumption"
  },
  {
    "name": "Bandwagon",
    "altNames": ["Appeal to Popularity", "Argumentum ad Populum"],
    "description": "Arguing that something is true or right because many people believe it or do it.",
    "logicalForm": "Most people believe X. Therefore, X is true.",
    "example": "Everyone is buying this product, so it must be good.",
    "category": "Relevance"
  },
  {
    "name": "Begging the Question",
    "altNames": ["Circular Reasoning", "Petitio Principii"],
    "description": "Using the conclusion of an argument as one of its premises.",
    "logicalForm": "A is true because B is true. B is true because A is true.",
    "example": "The Bible is true because it says so in the Bible.",
    "category": "Presumption"
  },
  {
    "name": "Cherry Picking",
    "altNames": ["Suppressing Evidence", "Fallacy of Incomplete Evidence"],
    "description": "Selecting only evidence that supports a particular position while ignoring evidence that contradicts it.",
    "logicalForm": "Evidence A supports conclusion X. Evidence B contradicts X. Therefore, only A is considered.",
    "example": "The new diet works because I lost weight in the first week, ignoring the fact that I gained it back later.",
    "category": "Relevance"
  },
  {
    "name": "Composition Fallacy",
    "altNames": ["Fallacy of Composition"],
    "description": "Assuming that what is true for the parts is also true for the whole.",
    "logicalForm": "Part A has property X. Therefore, whole B (which contains part A) has property X.",
    "example": "Each player on the team is a great athlete, so the team must be great.",
    "category": "Weak Induction"
  },
  {
    "name": "Division Fallacy",
    "altNames": ["Fallacy of Division"],
    "description": "Assuming that what is true for the whole is also true for its parts.",
    "logicalForm": "Whole B has property X. Therefore, part A (which is part of B) has property X.",
    "example": "The team is great, so each player must be great.",
    "category": "Weak Induction"
  },
  {
    "name": "False Analogy",
    "altNames": ["Weak Analogy", "Faulty Analogy"],
    "description": "Making a comparison between two things that are not sufficiently similar to warrant the conclusion.",
    "logicalForm": "A is like B. A has property X. Therefore, B has property X.",
    "example": "Employees are like nails; just as nails must be hit on the head to make them work, so must employees.",
    "category": "Weak Induction"
  },
  {
    "name": "False Cause",
    "altNames": ["Post Hoc Ergo Propter Hoc", "Correlation Not Causation"],
    "description": "Assuming causation based solely on temporal sequence or correlation.",
    "logicalForm": "A happened before B. Therefore, A caused B.",
    "example": "I wore my lucky socks and then we won the game. The socks must be why we won.",
    "category": "Weak Induction"
  },
  {
    "name": "False Dilemma",
    "altNames": ["False Dichotomy", "Either-Or Fallacy", "Black and White Fallacy"],
    "description": "Presenting only two options when more exist, forcing a choice between extremes.",
    "logicalForm": "Either X or Y. Not X. Therefore, Y.",
    "example": "You're either with us or against us.",
    "category": "Presumption"
  },
  {
    "name": "Gambler's Fallacy",
    "altNames": ["Monte Carlo Fallacy"],
    "description": "Believing that past random events affect the probabilities of future random events.",
    "logicalForm": "Event A has occurred multiple times. Therefore, event B (which is independent of A) is more likely to occur.",
    "example": "The roulette wheel has landed on red five times in a row, so black is due next.",
    "category": "Weak Induction"
  },
  {
    "name": "Genetic Fallacy",
    "altNames": ["Fallacy of Origin"],
    "description": "Judging something as either good or bad based on its origin rather than its current meaning or context.",
    "logicalForm": "X comes from source Y. Source Y is bad/good. Therefore, X is bad/good.",
    "example": "You can't trust that study on climate change because it was funded by an oil company.",
    "category": "Relevance"
  },
  {
    "name": "Hasty Generalization",
    "altNames": ["Faulty Generalization", "Jumping to Conclusions"],
    "description": "Drawing a broad conclusion from a small or unrepresentative sample.",
    "logicalForm": "Sample S is taken from population P. Conclusion C is drawn about P based on S.",
    "example": "I met two rude people from that city, so everyone from there must be rude.",
    "category": "Weak Induction"
  },
  {
    "name": "Middle Ground",
    "altNames": ["Argument to Moderation"],
    "description": "Assuming the compromise between two extremes is always correct.",
    "logicalForm": "Position X and position Y are extremes. Therefore, the middle position Z must be true.",
    "example": "Flat-Earthers say the Earth is flat; scientists say it’s round. The truth must be a dome shape.",
    "category": "Presumption"
  },
  {
    "name": "No True Scotsman",
    "altNames": ["No True Scotsman Fallacy"],
    "description": "Dismissing counterexamples to a generalization by redefining the terms.",
    "logicalForm": "Group A has property X. Counterexample Y is presented. Therefore, Y is not a true member of group A.",
    "example": "No true Scotsman puts sugar in his porridge.",
    "category": "Relevance"
  },
  {
    "name": "Red Herring",
    "altNames": ["Red Herring Fallacy"],
    "description": "Introducing irrelevant information to divert attention from the main argument.",
    "logicalForm": "Argument A is presented. Topic B is introduced. Therefore, argument A is false/ignored.",
    "example": "We shouldn't worry about the environment when there are so many people unemployed.",
    "category": "Relevance"
  },
  {
    "name": "Slippery Slope",
    "altNames": ["Slippery Slope Fallacy"],
    "description": "Arguing that one event will inevitably lead to a chain of negative consequences without sufficient evidence.",
    "logicalForm": "If A happens, then B will happen. If B happens, then C will happen. Therefore, if A happens, C will happen.",
    "example": "If we allow students to redo this exam, next they'll want to redo every assignment, and eventually they'll expect to pass without doing any work.",
    "category": "Weak Induction"
  },
  {
    "name": "Straw Man",
    "altNames": ["Straw Man Fallacy"],
    "description": "Misrepresenting someone's argument to make it easier to attack.",
    "logicalForm": "Person A has position X. Person B presents position Y (a distorted version of X). Person B attacks position Y. Therefore, X is false.",
    "example": "Person A: 'We should have stricter gun control.' Person B: 'Why do you want to take away all guns from law-abiding citizens?'",
    "category": "Relevance"
  },
  {
    "name": "Tu Quoque",
    "altNames": ["Appeal to Hypocrisy", "You Too Fallacy"],
    "description": "Dismissing someone's argument by accusing them of hypocrisy without addressing the argument itself.",
    "logicalForm": "Person A makes claim X. Person B responds with accusation Y against person A. Therefore, X is false.",
    "example": "How can you argue against smoking when you used to smoke?",
    "category": "Relevance"
  }
]