[
  {
    "name": "Ad Hominem",
    "altNames": ["Against the Person", "Poisoning the Well"],
    "description": "This fallacy occurs when an argument is rebutted by attacking the character, motive, or other attribute of the person making the argument, rather than attacking the substance of the argument itself. This includes pre-emptively discrediting a person before they have a chance to speak.",
    "logicalForm": "Person A makes claim X. Person B attacks person A. Therefore, claim X is false.",
    "example": "After Sally presents an eloquent and compelling case for a more equitable taxation system, Sam asks the audience whether we should believe anything from a woman who isn't married, was once arrested, and smells a bit weird.",
    "category": "Fallacies of Relevance",
    "source": "https://iep.utm.edu/fallacy/#AdHominem"
  },
  {
    "name": "Straw Man",
    "altNames": [],
    "description": "This fallacy occurs when someone takes another person's argument or point, distorts it or exaggerates it in some kind of extreme way, and then attacks the extreme distortion, as if that is really the claim the first person is making.",
    "logicalForm": "Person A has position X. Person B presents position Y (which is a distorted version of X). Person B attacks position Y. Therefore, X is false.",
    "example": "After Will said that we should put more money into health and education, Warren responded by saying that he was surprised that Will hates our country so much that he wants to leave it defenseless by cutting military spending.",
    "category": "Fallacies of Relevance",
    "source": "https://www.grammarly.com/blog/straw-man-fallacy/"
  },
  {
    "name": "Appeal to Ignorance",
    "altNames": ["Ad Ignorantiam", "Argument from Ignorance"],
    "description": "This fallacy occurs when you argue that your conclusion must be true, because there is no evidence against it. This fallacy wrongly shifts the burden of proof away from the one making the claim.",
    "logicalForm": "There is no proof that X is true. Therefore, X is false. (or vice versa)",
    "example": "No one has ever been able to prove that ghosts don't exist, so they must be real.",
    "category": "Fallacies of Relevance",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/appeal-to-ignorance.html"
  },
  {
    "name": "False Dilemma",
    "altNames": ["Black-or-White", "Either/Or", "False Dichotomy"],
    "description": "This fallacy presents a limited number of options (usually two) when in reality more options are available. It's a manipulative tool designed to polarize the audience, heroicizing one side and demonizing the other.",
    "logicalForm": "Either X or Y is true. Y is false. Therefore, X is true.",
    "example": "Either you're with us, or you're with the terrorists.",
    "category": "Fallacies of Presumption",
    "source": "https://owl.purdue.edu/owl/general_writing/academic_writing/logic_in_argumentative_writing/fallacies.html"
  },
  {
    "name": "Slippery Slope",
    "altNames": ["Domino Fallacy"],
    "description": "This fallacy occurs when someone argues that a certain course of action will inevitably lead to a chain of events that will end in a disastrous outcome, without providing evidence that the chain of events will actually occur.",
    "logicalForm": "If A happens, then B, C, ..., Z will happen. We don't want Z to happen. Therefore, we shouldn't do A.",
    "example": "If we legalize marijuana, then more people will start using heroin and crack, and then crime will explode. So, we can't legalize marijuana.",
    "category": "Fallacies of Presumption",
    "source": "https://www.scribbr.com/fallacies/slippery-slope-fallacy/"
  },
  {
    "name": "Circular Argument",
    "altNames": ["Circular Reasoning", "Begging the Question", "Petitio Principii"],
    "description": "This fallacy occurs when an argument's premises assume the truth of the conclusion, instead of supporting it. In other words, you assume without proof the very thing you are trying to prove.",
    "logicalForm": "X is true because of Y. Y is true because of X.",
    "example": "The Bible is the word of God because it says so in the Bible, and what the Bible says is true because it's the word of God.",
    "category": "Fallacies of Presumption",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/Begging-the-Question.html"
  },
  {
    "name": "Hasty Generalization",
    "altNames": ["Converse Accident", "Insufficient Statistics", "Faulty Generalization"],
    "description": "This is a fallacy in which a conclusion is not logically justified by sufficient or unbiased evidence. It's a conclusion based on a small sample size, rather than looking at statistics that are much more in line with the typical or average situation.",
    "logicalForm": "A small and/or unrepresentative sample is used to draw a conclusion about a population.",
    "example": "I met two people in New York who were rude. So, all New Yorkers are rude.",
    "category": "Fallacies of Presumption",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/Hasty-Generalization.html"
  },
  {
    "name": "Red Herring",
    "altNames": ["Ignoratio Elenchi", "Irrelevant Conclusion"],
    "description": "This is a fallacy in which an irrelevant topic is presented in order to divert attention from the original issue. The basic idea is to 'win' an argument by leading attention away from the argument and to another topic.",
    "logicalForm": "Topic A is under discussion. Topic B is introduced as being relevant to A (when it is not). Topic A is abandoned.",
    "example": "When criticized for his tax plan's effect on the poor, the politician started talking about the importance of national security and patriotism.",
    "category": "Fallacies of Relevance",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/Red-Herring.html"
  },
  {
    "name": "Appeal to Hypocrisy",
    "altNames": ["Tu Quoque", "You Too Fallacy"],
    "description": "This fallacy distracts from the argument by pointing out hypocrisy in the opponent. It dismisses a person's argument by asserting that their past actions or statements are inconsistent with their argument.",
    "logicalForm": "Person A makes claim X. Person B points out that A's actions or past claims are inconsistent with X. Therefore, X is false.",
    "example": "My doctor told me I should lose weight, but why should I listen to him? He's overweight himself.",
    "category": "Fallacies of Relevance",
    "source": "https://www.grammarly.com/blog/tu-quoque-fallacy/"
  },
  {
    "name": "Causal Fallacy",
    "altNames": ["False Cause", "Non Causa Pro Causa", "Post Hoc Ergo Propter Hoc", "Questionable Cause"],
    "description": "This fallacy occurs when an argument is made that assumes a cause-and-effect relationship between two events without sufficient evidence. A common version is 'post hoc ergo propter hoc' (after this, therefore because of this), where one event happening after another is seen as proof of causation.",
    "logicalForm": "Event A happened, then Event B happened. Therefore, A caused B.",
    "example": "The rooster crows just before the sun rises. Therefore, the rooster's crowing causes the sun to rise.",
    "category": "Fallacies of Presumption",
    "source": "https://www.scribbr.com/fallacies/causal-fallacy/"
  },
  {
    "name": "Sunk Cost Fallacy",
    "altNames": ["Appeal to Investment"],
    "description": "This fallacy occurs when someone continues a behavior or endeavor as a result of previously invested resources (time, money, or effort), regardless of whether the current costs outweigh the benefits.",
    "logicalForm": "Significant resources have already been invested in X. Therefore, more resources should be invested in X to not 'waste' the initial investment.",
    "example": "We've already spent millions on this project, we can't stop now, otherwise all that money will be wasted.",
    "category": "Fallacies of Relevance",
    "source": "https://www.grammarly.com/blog/sunk-cost-fallacy/"
  },
  {
    "name": "Appeal to Authority",
    "altNames": ["Ad Verecundiam", "Argument from Authority"],
    "description": "This fallacy occurs when the word of an authority is used on a subject, but that person is not a legitimate authority on the subject. It also includes appeals to vague or unnamed authorities.",
    "logicalForm": "Person A, who is an authority on subject X, makes a claim about subject Y. Therefore, the claim is true.",
    "example": "A famous actor claims that a certain brand of car is the safest on the market, so it must be true.",
    "category": "Fallacies of Relevance",
    "source": "https://owl.purdue.edu/owl/general_writing/academic_writing/logic_in_argumentative_writing/fallacies.html"
  },
  {
    "name": "Equivocation",
    "altNames": ["Ambiguity"],
    "description": "This fallacy occurs when a key term or phrase in an argument is used in an ambiguous way, with one meaning in one portion of the argument and then another meaning in another portion of the argument.",
    "logicalForm": "A key term is used with two or more different meanings in the same argument.",
    "example": "A feather is light. What is light cannot be dark. Therefore, a feather cannot be dark.",
    "category": "Fallacies of Ambiguity",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/Equivocation.html"
  },
  {
    "name": "Appeal to Pity",
    "altNames": ["Ad Misericordiam"],
    "description": "This fallacy takes place when an arguer tries to get people to accept a conclusion by making them feel sorry for someone.",
    "logicalForm": "An appeal to pity is made. Therefore, the conclusion is true.",
    "example": "You should not find the defendant guilty of murder, since it would break his poor mother's heart to see him sent to jail.",
    "category": "Fallacies of Relevance",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/Appeal-to-Pity.html"
  },
  {
    "name": "Bandwagon Fallacy",
    "altNames": ["Ad Populum", "Appeal to the People"],
    "description": "This fallacy is based on the assumption that the opinion of the majority is always valid: that is, everyone believes it, so you should too. It appeals to the emotions of a crowd, to the 'everyman'.",
    "logicalForm": "Most people believe X is true. Therefore, X is true.",
    "example": "Almost everyone in our neighborhood supports the new zoning law, so it must be a good idea.",
    "category": "Fallacies of Relevance",
    "source": "https://www.scribbr.com/fallacies/bandwagon-fallacy/"
  },
  {
    "name": "Guilt by Association",
    "altNames": [],
    "description": "This fallacy occurs when someone connects a person or idea to a demonized group or an individual with a negative reputation in order to discredit them, without providing any evidence that they share the negative attributes.",
    "logicalForm": "Person A is associated with negative person/group B. Therefore, Person A is also negative.",
    "example": "My opponent for this office once met with a controversial activist. We can't trust him to lead our city.",
    "category": "Fallacies of Relevance",
    "source": "https://www.logicallyfallacious.com/logicalfallacies/Guilt-by-Association"
  },
  {
    "name": "Affirming the Consequent",
    "altNames": ["Converse Error"],
    "description": "This is a formal fallacy that involves taking a true conditional statement (e.g., If P, then Q) and invalidly inferring its converse (If Q, then P). The fallacy lies in assuming that the consequent (Q) can only be caused by that specific antecedent (P).",
    "logicalForm": "If P, then Q. Q. Therefore, P.",
    "example": "If I have the flu, I have a fever. I have a fever. Therefore, I have the flu. (The fever could be caused by other illnesses).",
    "category": "Formal Fallacies",
    "source": "https://iep.utm.edu/fallacy/#AffirmingtheConsequent"
  },
  {
    "name": "Denying the Antecedent",
    "altNames": ["Inverse Error"],
    "description": "This is a formal fallacy that involves taking a true conditional statement (e.g., If P, then Q) and invalidly inferring its inverse (If not-P, then not-Q). The fallacy lies in assuming that if the antecedent (P) is false, the consequent (Q) must also be false.",
    "logicalForm": "If P, then Q. Not P. Therefore, not Q.",
    "example": "If it is raining, the grass is wet. It is not raining. Therefore, the grass is not wet. (The grass could be wet for other reasons, like a sprinkler).",
    "category": "Formal Fallacies",
    "source": "https://iep.utm.edu/fallacy/#DenyingtheAntecedent"
  },
  {
    "name": "Genetic Fallacy",
    "altNames": [],
    "description": "This fallacy avoids the argument by shifting focus onto the origin of the argument or the person making it, rather than the merits of the argument itself. The argument is accepted or rejected based on its source.",
    "logicalForm": "The origin of a claim is presented. Therefore, the claim is true/false.",
    "example": "The idea for that new policy came from a think tank funded by a corporation, so it must be bad for the public.",
    "category": "Fallacies of Relevance",
    "source": "https://owl.purdue.edu/owl/general_writing/academic_writing/logic_in_argumentative_writing/fallacies.html"
  },
  {
    "name": "Fallacy of Composition",
    "altNames": [],
    "description": "This fallacy occurs when one assumes that something true of the parts must also be true of the whole.",
    "logicalForm": "The parts of X have property A. Therefore, the whole X has property A.",
    "example": "Every player on the team is a superstar, so the team must be the best in the league and will definitely win the championship.",
    "category": "Fallacies of Presumption",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/composition.html"
  },
  {
    "name": "Fallacy of Division",
    "altNames": [],
    "description": "This fallacy is the opposite of the Fallacy of Composition. It occurs when one assumes that something true of a whole must also be true of all or some of its parts.",
    "logicalForm": "The whole X has property A. Therefore, the parts of X have property A.",
    "example": "Our company is very environmentally conscious. Therefore, every employee of our company must also be environmentally conscious.",
    "category": "Fallacies of Presumption",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/division.html"
  },
  {
    "name": "Accent Fallacy",
    "altNames": ["Accentus", "Misleading Accent"],
    "description": "This fallacy occurs when the meaning of a sentence is changed by placing an unusual emphasis on a word or phrase, which can lead to a misinterpretation of the statement.",
    "logicalForm": "The emphasis on a word or phrase changes the meaning of a sentence, leading to an incorrect conclusion.",
    "example": "A parent says, 'I didn't say you could borrow the car.' If 'I' is emphasized, it implies someone else gave permission. If 'car' is emphasized, it implies borrowing something else was okay.",
    "category": "Fallacies of Ambiguity",
    "source": "https://iep.utm.edu/fallacy/#Accent"
  },
  {
    "name": "Complex Question Fallacy",
    "altNames": ["Loaded Question"],
    "description": "This fallacy is committed when a question is asked that presupposes something that has not been proven or accepted by all the people involved. Any answer to the question implies agreement with the presupposition.",
    "logicalForm": "A question is asked that assumes the answer to an unstated question.",
    "example": "'So, have you stopped embezzling from the company?' This question presupposes that the person has embezzled in the past.",
    "category": "Fallacies of Presumption",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/complex-question.html"
  },
  {
    "name": "Appeal to Tradition",
    "altNames": ["Argumentum ad Antiquitatem"],
    "description": "This fallacy occurs when it is assumed that something is better or correct simply because it is older, traditional, or 'has always been done.'",
    "logicalForm": "X is old or traditional. Therefore, X is correct or better.",
    "example": "Our family has always had a big holiday party on Christmas Eve, so we have to keep doing it even though it's become very expensive and stressful.",
    "category": "Fallacies of Relevance",
    "source": "https://www.logicallyfallacious.com/logicalfallacies/Appeal-to-Tradition"
  },
  {
    "name": "Appeal to Novelty",
    "altNames": ["Argumentum ad Novitatem"],
    "description": "This fallacy occurs when it is assumed that something is better or correct simply because it is new.",
    "logicalForm": "X is new. Therefore, X is better or correct.",
    "example": "This new version of the software must be better than the old one because it was just released.",
    "category": "Fallacies of Relevance",
    "source": "https://www.logicallyfallacious.com/logicalfallacies/Appeal-to-Novelty"
  },
  {
    "name": "No True Scotsman",
    "altNames": ["Appeal to Purity"],
    "description": "This fallacy is a way of reinterpreting evidence in order to prevent the refutation of one's position. An arguer will redefine a category to exclude a counterexample.",
    "logicalForm": "All X are Y. (Someone presents evidence of an X that is not Y). Then the arguer redefines X to exclude the counterexample, stating that no 'true' X would be that way.",
    "example": "John: 'No Scotsman puts sugar on his porridge.' Mary: 'But my uncle Angus is a Scotsman and he puts sugar on his porridge.' John: 'Ah, but no *true* Scotsman puts sugar on his porridge.'",
    "category": "Fallacies of Ambiguity",
    "source": "https://iep.utm.edu/fallacy/#NoTrueScotsman"
  },
  {
    "name": "The Gambler's Fallacy",
    "altNames": ["Monte Carlo Fallacy"],
    "description": "This fallacy is the belief that if a particular event occurs more frequently than normal during the past it is less likely to happen in the future (or vice versa), when it has been established that the probability of such events does not depend on what has happened in the past.",
    "logicalForm": "Event X has happened multiple times in a row. Therefore, event X is less likely to happen on the next occasion.",
    "example": "The roulette wheel landed on black the last five times, so it's due to land on red next.",
    "category": "Fallacies of Presumption",
    "source": "https://www.txst.edu/philosophy/resources/fallacy-definitions/gamblers-fallacy.html"
  },
  {
    "name": "Texas Sharpshooter Fallacy",
    "altNames": [],
    "description": "This fallacy is committed when differences in data are ignored, but similarities are stressed. From this reasoning, a false conclusion is inferred. The name comes from a joke about a Texan who fires his gun at a barn wall, and then paints a target centered on the tightest cluster of hits.",
    "logicalForm": "A pattern is found in random data and is used to draw a conclusion, while ignoring the data that doesn't fit the pattern.",
    "example": "A psychic predicts that a major earthquake will happen in California this year. When a small tremor occurs, they claim their prediction was correct, ignoring the fact that small tremors are common.",
    "category": "Fallacies of Presumption",
    "source": "https://www.logicallyfallacious.com/logicalfallacies/Texas-Sharpshooter-Fallacy"
  },
  {
    "name": "Anecdotal Evidence Fallacy",
    "altNames": [],
    "description": "This fallacy occurs when a personal experience or an isolated example is used instead of a sound argument or compelling evidence. It's often used to dismiss statistics or scientific evidence.",
    "logicalForm": "A personal experience or anecdote is presented as evidence for a claim, which is then used to reject a more general or scientifically supported claim.",
    "example": "My grandfather smoked his whole life and lived to be 90, so smoking can't be that bad for you.",
    "category": "Fallacies of Presumption",
    "source": "https://www.scribbr.com/fallacies/anecdotal-evidence-fallacy/"
  },
    {
    "name": "The Fallacy Fallacy",
    "altNames": ["Argument from Fallacy"],
    "description": "This fallacy occurs when you presume that because a claim has been poorly argued, or a fallacy has been made, that the claim itself must be wrong.",
    "logicalForm": "Argument A for claim C contains a fallacy. Therefore, claim C is false.",
    "example": "The argument for vegetarianism was full of emotional appeals, so there must be no good reason to be a vegetarian.",
    "category": "Formal Fallacies",
    "source": "https://www.grammarly.com/blog/fallacy-fallacy/"
  }
]
